def area(a):
    """
    Вычисляет площадь квадрата по длине его стороны.
    Площадь квадрата вычисляется по формуле: A = a^2
    Аргументы:
        a (float or int): Длина стороны квадрата.
    Возвращает:
        float or int: Площадь квадрата.
    """
    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата по длине его стороны.
    Периметр квадрата вычисляется по формуле: P = 4 * a
    Аргументы:
        a (float or int): Длина стороны квадрата.
    Возвращает:
        float or int: Периметр квадрата.
    """
    return 4 * a
